
	.186
	.model	tiny,stdcall


;****************************************************************
;*		外部宣言					*
;****************************************************************
include	lib_dos.inc


;****************************************************************
;*		コード						*
;****************************************************************
;---------------------------------------------------------------|
;		ファイルのロード				|
;---------------------------------------------------------------|
;	●引数							|
;		hFile	ハンドル				|
;		iSize	サイズ					|
;		*cBuff	バッファのアドレス			|
;	●返り値						|
;		ax	読み込んだバイト数			|
;		cBuff	読み込んだデータ			|
;---------------------------------------------------------------|
.code
File_Load_s	proc	near	uses bx cx dx ds,
		hFile	:word,
		iSize	:word,
		cBuff	:far ptr byte


		lds	dx,cBuff
		mov	cx,iSize	;
		mov	bx,hFile	;bx←ハンドル
		mov	ah,3fh		;
		int	21h		;

		.if(carry?)			;割り当て失敗時に飛ぶ。
			invoke	File_Err	;
		.endif

		ret			;
File_Load_s	endp			;
;****************************************************************
	end
