
	.186
	.model	tiny,stdcall


;****************************************************************
;*		外部宣言					*
;****************************************************************
include	lib_dos.inc


;****************************************************************
;*		コード						*
;****************************************************************
;---------------------------------------------------------------|
;		ファイルのライト				|
;---------------------------------------------------------------|
;	●引数							|
;		hFile	ハンドル				|
;		iSize	書き込みバイト数			|
;		*cBuff	バッファのアドレス			|
;	●返り値						|
;		無し						|
;---------------------------------------------------------------|
.code
File_Write	proc	near	uses ax bx cx dx ds,
		hFile	:word,
		iSize	:word,
		cBuff	:far ptr byte


		lds	dx,cBuff
		mov	cx,iSize	;cx←サイズ
		mov	bx,hFile	;bx←ハンドル
		mov	ah,040h		;
		int	21h		;

		.if(carry?)			;割り当て失敗時に飛ぶ。
			invoke	File_Err	;
		.endif

		ret			;
File_Write	endp			;
;****************************************************************
	end
